zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_mdf.c
      /* Disable all interrupts and clear all pending flags */
      hmdf->Instance->DFLTIER = 0U;
      hmdf->Instance->DFLTISR = 0xFFFFFFFFU;

      /* Disable clock generator only for last MDF or ADF instance deinitialization */
      if (((v_mdf1InstanceCounter == 1U) && IS_MDF_INSTANCE(hmdf->Instance)) ||
          ((v_adf1InstanceCounter == 1U) && IS_ADF_INSTANCE(hmdf->Instance)))
      {
        MDF_TypeDef *p_mdf_base;
        /* Get MDF base according instance */
#if defined(MDF1)
        p_mdf_base = (IS_ADF_INSTANCE(hmdf->Instance)) ? ADF1 : MDF1;
#else
        p_mdf_base = ADF1;
#endif /* MDF1 */

        /* Disable clock generator */
        p_mdf_base->CKGCR &= ~(MDF_CKGCR_CKDEN);
      }

      /* Call MDF MSP deinit function */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      if (hmdf->MspDeInitCallback == NULL)
      {
        hmdf->MspDeInitCallback = HAL_MDF_MspDeInit;
      }
      hmdf->MspDeInitCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
      HAL_MDF_MspDeInit(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */

      /* Update instance counter and table */
      if (IS_ADF_INSTANCE(hmdf->Instance))
      {
        v_adf1InstanceCounter--;
      }
      else /* MDF instance */
      {
        v_mdf1InstanceCounter--;
      }
      a_mdfHandle[MDF_GetHandleNumberFromInstance(hmdf->Instance)] = (MDF_HandleTypeDef *) NULL;

      /* Update state */
      hmdf->State = HAL_MDF_STATE_RESET;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Initialize the MDF instance MSP.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_MspInit(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_MspInit could be implemented in the user file */
}

/**
  * @brief  De-initialize the MDF instance MSP.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_MspDeInit(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_MspDeInit could be implemented in the user file */
}

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user MDF callback to be used instead of the weak predefined callback.
  * @param  hmdf MDF handle.
  * @param  CallbackID ID of the callback to be registered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_MDF_ACQ_COMPLETE_CB_ID acquisition complete callback ID.
  *           @arg @ref HAL_MDF_ACQ_HALFCOMPLETE_CB_ID acquisition half complete callback ID.
  *           @arg @ref HAL_MDF_SAD_CB_ID sound activity detector callback ID (only for ADF instance).
  *           @arg @ref HAL_MDF_ERROR_CB_ID error callback ID.
  *           @arg @ref HAL_MDF_MSPINIT_CB_ID MSP init callback ID.
  *           @arg @ref HAL_MDF_MSPDEINIT_CB_ID MSP de-init callback ID.
  * @param  pCallback pointer to the callback function.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_RegisterCallback(MDF_HandleTypeDef        *hmdf,
                                           HAL_MDF_CallbackIDTypeDef CallbackID,
                                           pMDF_CallbackTypeDef      pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pCallback == NULL)
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }
  else
  {
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      switch (CallbackID)
      {
        case HAL_MDF_ACQ_COMPLETE_CB_ID :
          hmdf->AcqCpltCallback = pCallback;
          break;
        case HAL_MDF_ACQ_HALFCOMPLETE_CB_ID :
          hmdf->AcqHalfCpltCallback = pCallback;
          break;
        case HAL_MDF_SAD_CB_ID :
          hmdf->SadCallback = pCallback;
          break;
        case HAL_MDF_ERROR_CB_ID :
          hmdf->ErrorCallback = pCallback;
          break;
        case HAL_MDF_MSPINIT_CB_ID :
          hmdf->MspInitCallback = pCallback;
          break;
        case HAL_MDF_MSPDEINIT_CB_ID :
          hmdf->MspDeInitCallback = pCallback;
          break;
        default :
          /* Update error code and status */
          hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else if (hmdf->State == HAL_MDF_STATE_RESET)
    {
      switch (CallbackID)
      {
        case HAL_MDF_MSPINIT_CB_ID :
          hmdf->MspInitCallback = pCallback;
          break;
        case HAL_MDF_MSPDEINIT_CB_ID :
          hmdf->MspDeInitCallback = pCallback;
          break;
        default :
          /* Update error code and status */
          hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      /* Update error code and status */
      hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Unregister a user MDF callback.
  *         MDF callback is redirected to the weak predefined callback.
  * @param  hmdf MDF handle.
  * @param  CallbackID ID of the callback to be unregistered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_MDF_ACQ_COMPLETE_CB_ID acquisition complete callback ID.
  *           @arg @ref HAL_MDF_ACQ_HALFCOMPLETE_CB_ID acquisition half complete callback ID.
  *           @arg @ref HAL_MDF_SAD_CB_ID sound activity detector callback ID (only for ADF instance).
  *           @arg @ref HAL_MDF_ERROR_CB_ID error callback ID.
  *           @arg @ref HAL_MDF_MSPINIT_CB_ID MSP init callback ID.
  *           @arg @ref HAL_MDF_MSPDEINIT_CB_ID MSP de-init callback ID.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_UnRegisterCallback(MDF_HandleTypeDef        *hmdf,
                                             HAL_MDF_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hmdf->State == HAL_MDF_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_MDF_ACQ_COMPLETE_CB_ID :
        hmdf->AcqCpltCallback = HAL_MDF_AcqCpltCallback;
        break;
      case HAL_MDF_ACQ_HALFCOMPLETE_CB_ID :
        hmdf->AcqHalfCpltCallback = HAL_MDF_AcqHalfCpltCallback;
        break;
      case HAL_MDF_SAD_CB_ID :
        hmdf->SadCallback = HAL_MDF_SadCallback;
        break;
      case HAL_MDF_ERROR_CB_ID :
        hmdf->ErrorCallback = HAL_MDF_ErrorCallback;
        break;
      case HAL_MDF_MSPINIT_CB_ID :
        hmdf->MspInitCallback = HAL_MDF_MspInit;
        break;
      case HAL_MDF_MSPDEINIT_CB_ID :
        hmdf->MspDeInitCallback = HAL_MDF_MspDeInit;
        break;
      default :
        /* Update error code and status */
        hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else if (hmdf->State == HAL_MDF_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_MDF_MSPINIT_CB_ID :
        hmdf->MspInitCallback = HAL_MDF_MspInit;
        break;
      case HAL_MDF_MSPDEINIT_CB_ID :
        hmdf->MspDeInitCallback = HAL_MDF_MspDeInit;
        break;
      default :
        /* Update error code and status */
        hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Register specific MDF out-off limit detector callback
  *         to be used instead of the weak predefined callback.
  * @param  hmdf MDF handle.
  * @param  pCallback pointer to the out-off limit detector callback function.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_RegisterOldCallback(MDF_HandleTypeDef      *hmdf,
                                              pMDF_OldCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pCallback == NULL)
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }
  else
  {
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      hmdf->OldCallback = pCallback;
    }
    else
    {
      /* Update error code and status */
      hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Unregister the specific MDF out-off limit detector callback.
  *         MDF out-off limit detector callback is redirected to the weak predefined callback.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_UnRegisterOldCallback(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hmdf->State == HAL_MDF_STATE_READY)
  {
    hmdf->OldCallback = HAL_MDF_OldCallback;
  }
  else
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Register specific MDF sound level callback
  *         to be used instead of the weak predefined callback.
  * @param  hmdf MDF handle.
  * @param  pCallback pointer to the sound level callback function.
  * @retval HAL status.
  * @note   This function must not be used with MDF instance.
  */
HAL_StatusTypeDef HAL_MDF_RegisterSndLvlCallback(MDF_HandleTypeDef         *hmdf,
                                                 pMDF_SndLvlCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pCallback == NULL)
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }
  else
  {
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      hmdf->SndLvCallback = pCallback;
    }
    else
    {
      /* Update error code and status */
      hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Unregister the specific MDF sound level callback.
  *         MDF sound level callback is redirected to the weak predefined callback.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with MDF instance.
  */
HAL_StatusTypeDef HAL_MDF_UnRegisterSndLvlCallback(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hmdf->State == HAL_MDF_STATE_READY)
  {
    hmdf->SndLvCallback = HAL_MDF_SndLvlCallback;
  }
  else
  {
    /* Update error code and status */
    hmdf->ErrorCode |= MDF_ERROR_INVALID_CALLBACK;
    status = HAL_ERROR;
  }

  /* Return function status */
  return status;
}
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group2  Acquisition functions
  * @brief    Acquisition functions
  *
@verbatim
  ==============================================================================
                        ##### Acquisition functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Start and stop acquisition in polling, interrupt or DMA mode.
      (+) Wait and get acquisition values.
      (+) Generate pulse on TRGO signal.
      (+) Modify and get some filter parameters during acquisition.
      (+) Wait and get sound level values for ADF instance.
      (+) Detect sound activity for ADF instance.
@endverbatim
  * @{
  */

/**
  * @brief  This function allows to start acquisition in polling mode.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStart(MDF_HandleTypeDef *hmdf, const MDF_FilterConfigTypeDef *pFilterConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pFilterConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      assert_param(IS_ADF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
      assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    }
    else
    {
      assert_param(IS_MDF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
    }
    if ((IS_ADF_INSTANCE(hmdf->Instance)) && (pFilterConfig->SoundActivity.Activation == ENABLE) &&
        ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_WINDOW_CONT)))
    {
      status = HAL_ERROR;
    }
    /* Check state */
    else if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
    /* Check filter status */
    else if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* For ADF instance, check SAD status */
      if (IS_ADF_INSTANCE(hmdf->Instance))
      {
        if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
        {
          status = HAL_ERROR;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* For MDF instance, check OLD status and main filter order */
      assert_param(IS_MDF_CIC_MODE(pFilterConfig->CicMode));
      if (IS_MDF_INSTANCE(hmdf->Instance))
      {
        if (((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != 0U) && (pFilterConfig->CicMode >= MDF_ONE_FILTER_SINC4))
        {
          status = HAL_ERROR;
        }
      }

      if (status == HAL_OK)
      {
        /* Configure filter and start acquisition */
        hmdf->Instance->DFLTCR = 0U;
        MDF_AcqStart(hmdf, pFilterConfig);
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for available acquisition value.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_PollForAcq(MDF_HandleTypeDef *hmdf, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t tickstart = HAL_GetTick();

