zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_mdf.c
    /* Clear all potential pending flags */
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF |
                                  MDF_DFLTISR_SDDETF | MDF_DFLTISR_SDLVLF);
    }
    else
    {
      hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SSDRF | MDF_DFLTISR_SSOVRF |
                                  MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF);
    }

    /* Update state */
    hmdf->State = HAL_MDF_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start acquisition in interrupt mode.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStart_IT(MDF_HandleTypeDef *hmdf, const MDF_FilterConfigTypeDef *pFilterConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pFilterConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      assert_param(IS_ADF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
      assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    }
    else
    {
      assert_param(IS_MDF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
    }
    if ((IS_ADF_INSTANCE(hmdf->Instance)) && (pFilterConfig->SoundActivity.Activation == ENABLE) &&
        ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_WINDOW_CONT)))
    {
      status = HAL_ERROR;
    }
    /* Check state */
    else if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
    /* Check filter status */
    else if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* For ADF instance, check SAD status */
      if (IS_ADF_INSTANCE(hmdf->Instance))
      {
        if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
        {
          status = HAL_ERROR;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* For MDF instance, check OLD status and main filter order */
      assert_param(IS_MDF_CIC_MODE(pFilterConfig->CicMode));
      if (IS_MDF_INSTANCE(hmdf->Instance))
      {
        if (((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != 0U) && (pFilterConfig->CicMode >= MDF_ONE_FILTER_SINC4))
        {
          status = HAL_ERROR;
        }
      }

      if (status == HAL_OK)
      {
        if (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SNAPSHOT)
        {
          /* Enable snapshot overrun and data ready interrupts */
          hmdf->Instance->DFLTIER |= (MDF_DFLTIER_SSOVRIE | MDF_DFLTIER_SSDRIE);
        }
        else
        {
          if ((IS_MDF_INSTANCE(hmdf->Instance)) || (pFilterConfig->SoundActivity.Activation == DISABLE) ||
              (pFilterConfig->SoundActivity.DataMemoryTransfer != MDF_SAD_NO_MEMORY_TRANSFER))
          {
            /* Enable data overflow and fifo threshold interrupts */
            hmdf->Instance->DFLTIER |= (MDF_DFLTIER_DOVRIE | MDF_DFLTIER_FTHIE);
          }
        }

        if (pFilterConfig->ReshapeFilter.Activation == ENABLE)
        {
          /* Enable reshape filter overrun interrupt */
          hmdf->Instance->DFLTIER |= MDF_DFLTIER_RFOVRIE;
        }

        /* Enable saturation interrupt */
        hmdf->Instance->DFLTIER |= MDF_DFLTIER_SATIE;

        if ((IS_ADF_INSTANCE(hmdf->Instance)) && (pFilterConfig->SoundActivity.Activation == ENABLE))
        {
          /* Enable sound level value ready and sound activity detection interrupts */
          assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.SoundLevelInterrupt));
          hmdf->Instance->DFLTIER |= (pFilterConfig->SoundActivity.SoundLevelInterrupt == ENABLE) ?
                                     (MDF_DFLTIER_SDLVLIE | MDF_DFLTIER_SDDETIE) :
                                     MDF_DFLTIER_SDDETIE;
        }

        /* Configure filter and start acquisition */
        hmdf->Instance->DFLTCR = 0U;
        MDF_AcqStart(hmdf, pFilterConfig);
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop acquisition in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    /* Check if state is ready and filter active */
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != MDF_DFLTCR_DFLTACTIVE)
      {
        status = HAL_ERROR;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Disable sound activity detector if needed for ADF instance */
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
      {
        hmdf->Instance->SADCR &= ~(MDF_SADCR_SADEN);
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Disable filter */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DFLTEN);

    /* Disable interrupts and clear all potential pending flags */
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_FTHIE | MDF_DFLTIER_DOVRIE | MDF_DFLTIER_SATIE |
                                   MDF_DFLTIER_RFOVRIE | MDF_DFLTIER_SDDETIE | MDF_DFLTIER_SDLVLIE);
      hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF |
                                  MDF_DFLTISR_SDDETF | MDF_DFLTISR_SDLVLF);
    }
    else
    {
      hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_FTHIE | MDF_DFLTIER_DOVRIE | MDF_DFLTIER_SSDRIE |
                                   MDF_DFLTIER_SSOVRIE | MDF_DFLTIER_SATIE | MDF_DFLTIER_RFOVRIE);
      hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SSDRF | MDF_DFLTISR_SSOVRF |
                                  MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF);
    }

    /* Update state */
    hmdf->State = HAL_MDF_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start acquisition in DMA mode.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @param  pDmaConfig DMA configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStart_DMA(MDF_HandleTypeDef *hmdf, const MDF_FilterConfigTypeDef *pFilterConfig,
                                       const MDF_DmaConfigTypeDef *pDmaConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if ((pFilterConfig == NULL) || (pDmaConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_FUNCTIONAL_STATE(pDmaConfig->MsbOnly));
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      assert_param(IS_ADF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
      assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    }
    else
    {
      assert_param(IS_MDF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
    }
    if ((IS_ADF_INSTANCE(hmdf->Instance)) && (pFilterConfig->SoundActivity.Activation == ENABLE) &&
        ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_WINDOW_CONT)))
    {
      status = HAL_ERROR;
    }
    else if (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SNAPSHOT)
    {
      status = HAL_ERROR;
    }
    /* Check state */
    else if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
    /* Check filter status */
    else if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* For ADF instance, check SAD status */
      if (IS_ADF_INSTANCE(hmdf->Instance))
      {
        if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
        {
          status = HAL_ERROR;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* For MDF instance, check OLD status and main filter order */
      assert_param(IS_MDF_CIC_MODE(pFilterConfig->CicMode));
      if (IS_MDF_INSTANCE(hmdf->Instance))
      {
        if (((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != 0U) && (pFilterConfig->CicMode >= MDF_ONE_FILTER_SINC4))
        {
          status = HAL_ERROR;
        }
      }

      if (status == HAL_OK)
      {
        uint32_t SrcAddress;

        if (pFilterConfig->ReshapeFilter.Activation == ENABLE)
        {
          /* Enable reshape filter overrun interrupt */
          hmdf->Instance->DFLTIER |= MDF_DFLTIER_RFOVRIE;
        }

        /* Enable saturation interrupt */
        hmdf->Instance->DFLTIER |= MDF_DFLTIER_SATIE;

