zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_mdf.c
      /* Clear potential pending short-circuit detection flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_SCDF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start short-circuit detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @param  pScdConfig Short-circuit detector configuration parameters.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_ScdStart_IT(MDF_HandleTypeDef *hmdf, const MDF_ScdConfigTypeDef *pScdConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pScdConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_MDF_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_SCD_THRESHOLD(pScdConfig->Threshold));
    assert_param(IS_MDF_BREAK_SIGNAL(pScdConfig->BreakSignal));

    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      if (hmdf->State != HAL_MDF_STATE_READY)
      {
        status = HAL_ERROR;
      }
    }

    if (status == HAL_OK)
    {
      /* Check short-circuit detector status */
      if ((hmdf->Instance->SCDCR & MDF_SCDCR_SCDACTIVE) == MDF_SCDCR_SCDACTIVE)
      {
        status = HAL_ERROR;
      }
      else
      {
        /* Configure threshold and break signal */
        hmdf->Instance->SCDCR = (((pScdConfig->Threshold - 1U) << MDF_SCDCR_SCDT_Pos) |
                                 (pScdConfig->BreakSignal << MDF_SCDCR_BKSCD_Pos));

        /* Enable short-circuit detector interrupt */
        hmdf->Instance->DFLTIER |= MDF_DFLTIER_SCDIE;

        /* Enable short-circuit detector */
        hmdf->Instance->SCDCR |= MDF_SCDCR_SCDEN;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop short-circuit detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_ScdStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check short-circuit detector status */
    if ((hmdf->Instance->SCDCR & MDF_SCDCR_SCDACTIVE) != MDF_SCDCR_SCDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Disable short-circuit detection */
      hmdf->Instance->SCDCR &= ~(MDF_SCDCR_SCDEN);

      /* Disable short-circuit detection interrupt */
      hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_SCDIE);

      /* Clear potential pending short-circuit detection flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_SCDF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group5  Out-off limit detection functions
  * @brief    Out-off limit detection functions
  *
@verbatim
  ==============================================================================
                  ##### Out-off limit detection functions #####
  ==============================================================================
    [..]  This section provides functions available only for MDF instance
          allowing to :
      (+) Start and stop out-off limit detection in polling and interrupt mode.
      (+) Detect short circuit and get threshold information.
@endverbatim
  * @{
  */

/**
  * @brief  This function allows to start out-off limit detection in polling mode.
  * @param  hmdf MDF handle.
  * @param  pOldConfig Out-off limit detector configuration parameters.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_OldStart(MDF_HandleTypeDef *hmdf, const MDF_OldConfigTypeDef *pOldConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pOldConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_MDF_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_OLD_CIC_MODE(pOldConfig->OldCicMode));
    assert_param(IS_MDF_OLD_DECIMATION_RATIO(pOldConfig->OldDecimationRatio));
    assert_param(IS_MDF_OLD_THRESHOLD(pOldConfig->HighThreshold));
    assert_param(IS_MDF_OLD_THRESHOLD(pOldConfig->LowThreshold));
    assert_param(IS_MDF_OLD_EVENT_CONFIG(pOldConfig->OldEventConfig));
    assert_param(IS_MDF_BREAK_SIGNAL(pOldConfig->BreakSignal));
    if (pOldConfig->LowThreshold >= pOldConfig->HighThreshold)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Check state */
      if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
      {
        if (hmdf->State != HAL_MDF_STATE_READY)
        {
          status = HAL_ERROR;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Check out-off limit detector status */
      if ((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) == MDF_OLDCR_OLDACTIVE)
      {
        status = HAL_ERROR;
      }
      else
      {
        /* Check filter status */
        if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) == MDF_DFLTCR_DFLTACTIVE)
        {
          /* Check main filter order */
          if ((hmdf->Instance->DFLTCICR & MDF_DFLTCICR_CICMOD) >= MDF_ONE_FILTER_SINC4)
          {
            status = HAL_ERROR;
          }
        }
        else
        {
          /* Reset main filter order */
          hmdf->Instance->DFLTCICR &= ~(MDF_DFLTCICR_CICMOD);
        }

        if (status == HAL_OK)
        {
          /* Configure OLD CIC mode, decimation ratio, event and break signal */
          hmdf->Instance->OLDCR = (pOldConfig->OldCicMode | pOldConfig->OldEventConfig |
                                   ((pOldConfig->OldDecimationRatio - 1U) << MDF_OLDCR_ACICD_Pos) |
                                   (pOldConfig->BreakSignal << MDF_OLDCR_BKOLD_Pos));

          /* Configure low and high thresholds */
          hmdf->Instance->OLDTHLR = (uint32_t) pOldConfig->LowThreshold;
          hmdf->Instance->OLDTHHR = (uint32_t) pOldConfig->HighThreshold;

