zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_mdf.c
    /* Clear out-off limit detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_OLDF;

    /* Update error code */
    hmdf->ErrorCode |= MDF_ERROR_OUT_OFF_LIMIT;

    /* Call out-off limit detection callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->OldCallback(hmdf, threshold_info);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_OldCallback(hmdf, threshold_info);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if sound activity detection occurs */
  if ((interrupts & MDF_DFLTISR_SDDETF) == MDF_DFLTISR_SDDETF)
  {
    /* Clear sound activity detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SDDETF;

    /* Call sound activity detection callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->SadCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_SadCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
  /* Check if sound level ready occurs */
  if ((interrupts & MDF_DFLTISR_SDLVLF) == MDF_DFLTISR_SDLVLF)
  {
    uint32_t sound_level;
    uint32_t ambient_noise;

    /* Get sound level */
    sound_level = hmdf->Instance->SADSDLVR;

    /* Get ambient noise */
    ambient_noise = hmdf->Instance->SADANLVR;

    /* Clear sound level ready flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SDLVLF;

    /* Call sound level callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
    hmdf->SndLvCallback(hmdf, sound_level, ambient_noise);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
    HAL_MDF_SndLvlCallback(hmdf, sound_level, ambient_noise);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  MDF error callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_ErrorCallback could be implemented in the user file */
}

/**
  * @brief  This function allows to get the current MDF state.
  * @param  hmdf MDF handle.
  * @retval MDF state.
  */
HAL_MDF_StateTypeDef HAL_MDF_GetState(const MDF_HandleTypeDef *hmdf)
{
  /* Return MDF state */
  return hmdf->State;
}

/**
  * @brief  This function allows to get the current MDF error.
  * @param  hmdf MDF handle.
  * @retval MDF error code.
  */
uint32_t HAL_MDF_GetError(const MDF_HandleTypeDef *hmdf)
{
  /* Return MDF error code */
  return hmdf->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup MDF_Private_Functions
  * @brief      Private functions
  * @{
  */

/**
  * @brief  This function allows to get the handle number from instance.
  * @param  pInstance MDF instance.
  * @retval Instance number.
  */
static uint32_t MDF_GetHandleNumberFromInstance(const MDF_Filter_TypeDef *const pInstance)
{
  uint32_t handle_number;

#if defined(MDF1)
  /* Get handle number from instance */
  if (pInstance == MDF1_Filter0)
  {
    handle_number = 0U;
  }
  else if (pInstance == MDF1_Filter1)
  {
    handle_number = 1U;
  }
  else if (pInstance == MDF1_Filter2)
  {
    handle_number = 2U;
  }
  else if (pInstance == MDF1_Filter3)
  {
    handle_number = 3U;
  }
  else if (pInstance == MDF1_Filter4)
  {
    handle_number = 4U;
  }
  else if (pInstance == MDF1_Filter5)
  {
    handle_number = 5U;
  }
  else if (pInstance == MDF1_Filter6)
  {
    handle_number = 6U;
  }
  else if (pInstance == MDF1_Filter7)
  {
    handle_number = 7U;
  }
  else /* ADF1_Filter0 */
  {
    handle_number = 8U;
  }
#else
  /* Get handle number from instance */
  handle_number = 8U;
  UNUSED(pInstance);
#endif /* MDF1 */

  return handle_number;
}

/**
  * @brief  This function allows to configure filter and start acquisition.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @retval None.
  */
static void MDF_AcqStart(MDF_HandleTypeDef *const hmdf, const MDF_FilterConfigTypeDef *const pFilterConfig)
{
  uint32_t register_gain_value;

  /* Configure acquisition mode, discard samples, trigger and fifo threshold */
  assert_param(IS_MDF_DISCARD_SAMPLES(pFilterConfig->DiscardSamples));
  assert_param(IS_MDF_FIFO_THRESHOLD(pFilterConfig->FifoThreshold));
  if ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_CONT) ||
      (pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE))
  {
    /* Trigger parameters are not used */
    hmdf->Instance->DFLTCR |= (pFilterConfig->AcquisitionMode | pFilterConfig->FifoThreshold |
                               (pFilterConfig->DiscardSamples << MDF_DFLTCR_NBDIS_Pos));
  }
  else
  {
    /* Trigger parameters are used */
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      assert_param(IS_ADF_TRIGGER_SOURCE(pFilterConfig->Trigger.Source));
    }
    else
    {
      assert_param(IS_MDF_TRIGGER_SOURCE(pFilterConfig->Trigger.Source));
    }
    assert_param(IS_MDF_TRIGGER_EDGE(pFilterConfig->Trigger.Edge));
    hmdf->Instance->DFLTCR |= (pFilterConfig->AcquisitionMode | pFilterConfig->FifoThreshold |
                               pFilterConfig->Trigger.Source | pFilterConfig->Trigger.Edge |
                               (pFilterConfig->DiscardSamples << MDF_DFLTCR_NBDIS_Pos));
  }

  /* Configure if needed snapshot format only for MDF instance */
  if (IS_MDF_INSTANCE(hmdf->Instance) && (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SNAPSHOT))
  {
    assert_param(IS_MDF_SNAPSHOT_FORMAT(pFilterConfig->SnapshotFormat));
    hmdf->Instance->DFLTCR |= pFilterConfig->SnapshotFormat;
  }

  /* Configure data source, CIC mode, decimation ratio and gain */
  if (IS_ADF_INSTANCE(hmdf->Instance))
  {
    assert_param(IS_ADF_DATA_SOURCE(pFilterConfig->DataSource));
    assert_param(IS_ADF_CIC_MODE(pFilterConfig->CicMode));
  }
  else
  {
    assert_param(IS_MDF_DATA_SOURCE(pFilterConfig->DataSource));
  }
  assert_param(IS_MDF_DECIMATION_RATIO(pFilterConfig->DecimationRatio));
  assert_param(IS_MDF_GAIN(pFilterConfig->Gain));
  if (pFilterConfig->Gain < 0)
  {
    int32_t adjust_gain;

    /* adjust gain value to set on register for negative value (offset of -16) */
    adjust_gain = pFilterConfig->Gain - 16;
    register_gain_value = ((uint32_t) adjust_gain & 0x3FU);
  }
  else
  {
    /* for positive value, no offset to apply */
    register_gain_value = (uint32_t) pFilterConfig->Gain;
  }
  hmdf->Instance->DFLTCICR = (pFilterConfig->DataSource | pFilterConfig->CicMode |
                              ((pFilterConfig->DecimationRatio - 1U) << MDF_DFLTCICR_MCICD_Pos) |
                              (register_gain_value << MDF_DFLTCICR_SCALE_Pos));

  /* Configure bitstream delay */
  assert_param(IS_MDF_DELAY(pFilterConfig->Delay));
  hmdf->Instance->DLYCR = pFilterConfig->Delay;

  /* Configure offset compensation only for MDF instance */
  if (IS_MDF_INSTANCE(hmdf->Instance))
  {
    assert_param(IS_MDF_OFFSET(pFilterConfig->Offset));
    hmdf->Instance->OECCR = (uint32_t) pFilterConfig->Offset;
  }

  /* Configure reshape filter */
  assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->ReshapeFilter.Activation));
  hmdf->Instance->DFLTRSFR = 0U;
  if (pFilterConfig->ReshapeFilter.Activation == ENABLE)
  {
    /* Configure reshape filter decimation ratio */
    assert_param(IS_MDF_RSF_DECIMATION_RATIO(pFilterConfig->ReshapeFilter.DecimationRatio));
    hmdf->Instance->DFLTRSFR |= pFilterConfig->ReshapeFilter.DecimationRatio;
  }
  else
  {
    /* Bypass reshape filter */
    hmdf->Instance->DFLTRSFR |= MDF_DFLTRSFR_RSFLTBYP;
  }

  /* Configure high-pass filter */
  assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->HighPassFilter.Activation));
  if (pFilterConfig->HighPassFilter.Activation == ENABLE)
  {
    /* Configure high-pass filter cut-off frequency */
    assert_param(IS_MDF_HPF_CUTOFF_FREQ(pFilterConfig->HighPassFilter.CutOffFrequency));
    hmdf->Instance->DFLTRSFR |= pFilterConfig->HighPassFilter.CutOffFrequency;
  }
  else
  {
    /* Bypass high-pass filter */
    hmdf->Instance->DFLTRSFR |= MDF_DFLTRSFR_HPFBYP;
  }

  /* Configure integrator only for MDF instance */
  if (IS_MDF_INSTANCE(hmdf->Instance))
  {
    assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->Integrator.Activation));
    if (pFilterConfig->Integrator.Activation == ENABLE)
    {
      /* Configure integrator value and output division */
      assert_param(IS_MDF_INTEGRATOR_VALUE(pFilterConfig->Integrator.Value));
      assert_param(IS_MDF_INTEGRATOR_OUTPUT_DIV(pFilterConfig->Integrator.OutputDivision));
      hmdf->Instance->DFLTINTR = (((pFilterConfig->Integrator.Value - 1U) << MDF_DFLTINTR_INTVAL_Pos) |
                                  pFilterConfig->Integrator.OutputDivision);
    }
    else
    {
      /* Bypass integrator */
      hmdf->Instance->DFLTINTR = 0U;
    }
  }

  if (IS_ADF_INSTANCE(hmdf->Instance))
  {
    assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    if (pFilterConfig->SoundActivity.Activation == ENABLE)
    {
      /* Configure SAD mode, frame size, hysteresis, sound trigger event
         and data memory transfer only for ADF instance */
      assert_param(IS_MDF_SAD_MODE(pFilterConfig->SoundActivity.Mode));
      assert_param(IS_MDF_SAD_FRAME_SIZE(pFilterConfig->SoundActivity.FrameSize));
      if (pFilterConfig->SoundActivity.Mode != MDF_SAD_AMBIENT_NOISE_DETECTOR)
      {
        assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Hysteresis));
      }
      assert_param(IS_MDF_SAD_SOUND_TRIGGER(pFilterConfig->SoundActivity.SoundTriggerEvent));
      assert_param(IS_MDF_SAD_DATA_MEMORY_TRANSFER(pFilterConfig->SoundActivity.DataMemoryTransfer));
      if ((pFilterConfig->SoundActivity.Mode != MDF_SAD_AMBIENT_NOISE_DETECTOR) &&
          (pFilterConfig->SoundActivity.Hysteresis == ENABLE))
      {
        hmdf->Instance->SADCR = (pFilterConfig->SoundActivity.Mode | pFilterConfig->SoundActivity.FrameSize |
                                 MDF_SADCR_HYSTEN | pFilterConfig->SoundActivity.SoundTriggerEvent |
                                 pFilterConfig->SoundActivity.DataMemoryTransfer);
      }
      else
      {
        hmdf->Instance->SADCR = (pFilterConfig->SoundActivity.Mode | pFilterConfig->SoundActivity.FrameSize |
                                 pFilterConfig->SoundActivity.SoundTriggerEvent |
                                 pFilterConfig->SoundActivity.DataMemoryTransfer);
      }

      /* Configure SAD minimum noise level, hangover window, learning frames,
         ambient noise slope control and signal noise threshold only for ADF instance */
      assert_param(IS_MDF_SAD_MIN_NOISE_LEVEL(pFilterConfig->SoundActivity.MinNoiseLevel));
      assert_param(IS_MDF_SAD_HANGOVER_WINDOW(pFilterConfig->SoundActivity.HangoverWindow));
      assert_param(IS_MDF_SAD_LEARNING_FRAMES(pFilterConfig->SoundActivity.LearningFrames));
      assert_param(IS_MDF_SAD_SIGNAL_NOISE_THRESHOLD(pFilterConfig->SoundActivity.SignalNoiseThreshold));
      if (pFilterConfig->SoundActivity.Mode != MDF_SAD_SOUND_DETECTOR)
      {
        assert_param(IS_MDF_SAD_AMBIENT_NOISE_SLOPE(pFilterConfig->SoundActivity.AmbientNoiseSlope));
        hmdf->Instance->SADCFGR = ((pFilterConfig->SoundActivity.MinNoiseLevel << MDF_SADCFGR_ANMIN_Pos) |
                                   pFilterConfig->SoundActivity.HangoverWindow |
                                   pFilterConfig->SoundActivity.LearningFrames |
                                   (pFilterConfig->SoundActivity.AmbientNoiseSlope << MDF_SADCFGR_ANSLP_Pos) |
                                   pFilterConfig->SoundActivity.SignalNoiseThreshold);
      }
      else
      {
        hmdf->Instance->SADCFGR = ((pFilterConfig->SoundActivity.MinNoiseLevel << MDF_SADCFGR_ANMIN_Pos) |
                                   pFilterConfig->SoundActivity.HangoverWindow |
                                   pFilterConfig->SoundActivity.LearningFrames |
                                   pFilterConfig->SoundActivity.SignalNoiseThreshold);
      }
    }
    else
    {
      /* SAD is not used */
      hmdf->Instance->SADCR = 0U;
      hmdf->Instance->SADCFGR = 0U;
    }
  }

  /* Update instance state */
  hmdf->State = HAL_MDF_STATE_ACQUISITION;

  /* Enable sound activity detector if needed only for ADF instance */
  if ((IS_ADF_INSTANCE(hmdf->Instance)) && (pFilterConfig->SoundActivity.Activation == ENABLE))
  {
    hmdf->Instance->SADCR |= MDF_SADCR_SADEN;
  }

